origin_redis/redis/bench-results/ext/fs_redis_fdp_disabled_everysec/last/summary_1.txt
====== SET ======
  23592960 requests completed in 1005.77 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.151 milliseconds (cumulative count 4)
50.000% <= 0.807 milliseconds (cumulative count 11980792)
75.000% <= 1.039 milliseconds (cumulative count 17755683)
87.500% <= 1.255 milliseconds (cumulative count 20668637)
93.750% <= 1.479 milliseconds (cumulative count 22149462)
96.875% <= 1.687 milliseconds (cumulative count 22866002)
98.438% <= 2.063 milliseconds (cumulative count 23224748)
99.219% <= 13.759 milliseconds (cumulative count 23408647)
99.609% <= 38.719 milliseconds (cumulative count 23500842)
99.805% <= 101.119 milliseconds (cumulative count 23546899)
99.902% <= 144.255 milliseconds (cumulative count 23569933)
99.951% <= 177.535 milliseconds (cumulative count 23581468)
99.976% <= 318.719 milliseconds (cumulative count 23587200)
99.988% <= 674.303 milliseconds (cumulative count 23590087)
99.994% <= 4415.487 milliseconds (cumulative count 23591560)
99.997% <= 6389.759 milliseconds (cumulative count 23592260)
99.998% <= 7442.431 milliseconds (cumulative count 23592609)
99.999% <= 8585.215 milliseconds (cumulative count 23592810)
100.000% <= 9486.335 milliseconds (cumulative count 23592910)
100.000% <= 9732.095 milliseconds (cumulative count 23592960)
100.000% <= 9732.095 milliseconds (cumulative count 23592960)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 420)
0.240% <= 0.303 milliseconds (cumulative count 56640)
3.847% <= 0.407 milliseconds (cumulative count 907526)
11.431% <= 0.503 milliseconds (cumulative count 2696826)
22.990% <= 0.607 milliseconds (cumulative count 5424034)
35.212% <= 0.703 milliseconds (cumulative count 8307536)
50.781% <= 0.807 milliseconds (cumulative count 11980792)
62.556% <= 0.903 milliseconds (cumulative count 14758819)
72.663% <= 1.007 milliseconds (cumulative count 17143464)
79.827% <= 1.103 milliseconds (cumulative count 18833509)
85.553% <= 1.207 milliseconds (cumulative count 20184387)
89.341% <= 1.303 milliseconds (cumulative count 21078222)
92.279% <= 1.407 milliseconds (cumulative count 21771237)
94.354% <= 1.503 milliseconds (cumulative count 22260875)
96.034% <= 1.607 milliseconds (cumulative count 22657195)
97.058% <= 1.703 milliseconds (cumulative count 22898821)
97.749% <= 1.807 milliseconds (cumulative count 23061993)
98.128% <= 1.903 milliseconds (cumulative count 23151308)
98.360% <= 2.007 milliseconds (cumulative count 23206131)
98.484% <= 2.103 milliseconds (cumulative count 23235183)
98.763% <= 3.103 milliseconds (cumulative count 23301078)
98.810% <= 4.103 milliseconds (cumulative count 23312260)
98.849% <= 5.103 milliseconds (cumulative count 23321517)
98.902% <= 6.103 milliseconds (cumulative count 23333802)
98.921% <= 7.103 milliseconds (cumulative count 23338388)
98.942% <= 8.103 milliseconds (cumulative count 23343315)
98.999% <= 9.103 milliseconds (cumulative count 23356831)
99.046% <= 10.103 milliseconds (cumulative count 23367932)
99.105% <= 11.103 milliseconds (cumulative count 23381872)
99.162% <= 12.103 milliseconds (cumulative count 23395234)
99.198% <= 13.103 milliseconds (cumulative count 23403728)
99.231% <= 14.103 milliseconds (cumulative count 23411549)
99.266% <= 15.103 milliseconds (cumulative count 23419890)
99.298% <= 16.103 milliseconds (cumulative count 23427240)
99.327% <= 17.103 milliseconds (cumulative count 23434095)
99.352% <= 18.111 milliseconds (cumulative count 23440067)
99.371% <= 19.103 milliseconds (cumulative count 23444618)
99.393% <= 20.111 milliseconds (cumulative count 23449809)
99.415% <= 21.103 milliseconds (cumulative count 23454925)
99.435% <= 22.111 milliseconds (cumulative count 23459666)
99.453% <= 23.103 milliseconds (cumulative count 23463840)
99.467% <= 24.111 milliseconds (cumulative count 23467326)
99.481% <= 25.103 milliseconds (cumulative count 23470434)
99.494% <= 26.111 milliseconds (cumulative count 23473613)
99.505% <= 27.103 milliseconds (cumulative count 23476214)
99.518% <= 28.111 milliseconds (cumulative count 23479298)
99.531% <= 29.103 milliseconds (cumulative count 23482354)
99.542% <= 30.111 milliseconds (cumulative count 23484975)
99.551% <= 31.103 milliseconds (cumulative count 23487001)
99.560% <= 32.111 milliseconds (cumulative count 23489066)
99.570% <= 33.119 milliseconds (cumulative count 23491424)
99.580% <= 34.111 milliseconds (cumulative count 23493887)
99.587% <= 35.103 milliseconds (cumulative count 23495432)
99.595% <= 36.127 milliseconds (cumulative count 23497378)
99.601% <= 37.119 milliseconds (cumulative count 23498773)
99.606% <= 38.111 milliseconds (cumulative count 23500024)
99.612% <= 39.103 milliseconds (cumulative count 23501323)
99.618% <= 40.127 milliseconds (cumulative count 23502795)
99.623% <= 41.119 milliseconds (cumulative count 23504031)
99.628% <= 42.111 milliseconds (cumulative count 23505185)
99.634% <= 43.103 milliseconds (cumulative count 23506508)
99.640% <= 44.127 milliseconds (cumulative count 23508056)
99.645% <= 45.119 milliseconds (cumulative count 23509153)
99.648% <= 46.111 milliseconds (cumulative count 23509838)
99.650% <= 47.103 milliseconds (cumulative count 23510389)
99.655% <= 48.127 milliseconds (cumulative count 23511628)
99.659% <= 49.119 milliseconds (cumulative count 23512526)
99.662% <= 50.111 milliseconds (cumulative count 23513216)
99.667% <= 51.103 milliseconds (cumulative count 23514315)
99.669% <= 52.127 milliseconds (cumulative count 23514867)
99.671% <= 53.119 milliseconds (cumulative count 23515329)
99.674% <= 54.111 milliseconds (cumulative count 23516047)
99.677% <= 55.103 milliseconds (cumulative count 23516827)
99.680% <= 56.127 milliseconds (cumulative count 23517453)
99.682% <= 57.119 milliseconds (cumulative count 23517844)
99.683% <= 58.111 milliseconds (cumulative count 23518249)
99.685% <= 59.103 milliseconds (cumulative count 23518730)
99.687% <= 60.127 milliseconds (cumulative count 23519185)
99.689% <= 61.119 milliseconds (cumulative count 23519560)
99.691% <= 62.111 milliseconds (cumulative count 23520004)
99.692% <= 63.103 milliseconds (cumulative count 23520202)
99.693% <= 64.127 milliseconds (cumulative count 23520606)
99.695% <= 65.119 milliseconds (cumulative count 23520973)
99.697% <= 66.111 milliseconds (cumulative count 23521428)
99.699% <= 67.135 milliseconds (cumulative count 23521955)
99.701% <= 68.159 milliseconds (cumulative count 23522364)
99.704% <= 69.119 milliseconds (cumulative count 23523096)
99.706% <= 70.143 milliseconds (cumulative count 23523658)
99.709% <= 71.103 milliseconds (cumulative count 23524417)
99.713% <= 72.127 milliseconds (cumulative count 23525345)
99.716% <= 73.151 milliseconds (cumulative count 23525994)
99.718% <= 74.111 milliseconds (cumulative count 23526469)
99.721% <= 75.135 milliseconds (cumulative count 23527239)
99.724% <= 76.159 milliseconds (cumulative count 23527883)
99.727% <= 77.119 milliseconds (cumulative count 23528451)
99.729% <= 78.143 milliseconds (cumulative count 23528998)
99.730% <= 79.103 milliseconds (cumulative count 23529359)
99.734% <= 80.127 milliseconds (cumulative count 23530224)
99.738% <= 81.151 milliseconds (cumulative count 23531237)
99.744% <= 82.111 milliseconds (cumulative count 23532476)
99.749% <= 83.135 milliseconds (cumulative count 23533632)
99.753% <= 84.159 milliseconds (cumulative count 23534575)
99.755% <= 85.119 milliseconds (cumulative count 23535180)
99.758% <= 86.143 milliseconds (cumulative count 23535824)
99.762% <= 87.103 milliseconds (cumulative count 23536807)
99.765% <= 88.127 milliseconds (cumulative count 23537628)
99.768% <= 89.151 milliseconds (cumulative count 23538333)
99.772% <= 90.111 milliseconds (cumulative count 23539275)
99.776% <= 91.135 milliseconds (cumulative count 23540224)
99.781% <= 92.159 milliseconds (cumulative count 23541298)
99.784% <= 93.119 milliseconds (cumulative count 23542006)
99.786% <= 94.143 milliseconds (cumulative count 23542485)
99.787% <= 95.103 milliseconds (cumulative count 23542747)
99.790% <= 96.127 milliseconds (cumulative count 23543312)
99.793% <= 97.151 milliseconds (cumulative count 23544023)
99.796% <= 98.111 milliseconds (cumulative count 23544720)
99.799% <= 99.135 milliseconds (cumulative count 23545464)
99.801% <= 100.159 milliseconds (cumulative count 23546037)
99.805% <= 101.119 milliseconds (cumulative count 23546899)
99.810% <= 102.143 milliseconds (cumulative count 23548065)
99.813% <= 103.103 milliseconds (cumulative count 23548930)
99.815% <= 104.127 milliseconds (cumulative count 23549423)
99.816% <= 105.151 milliseconds (cumulative count 23549661)
99.818% <= 106.111 milliseconds (cumulative count 23549980)
99.819% <= 107.135 milliseconds (cumulative count 23550177)
99.821% <= 108.159 milliseconds (cumulative count 23550661)
99.823% <= 109.119 milliseconds (cumulative count 23551220)
99.824% <= 110.143 milliseconds (cumulative count 23551528)
99.826% <= 111.103 milliseconds (cumulative count 23551876)
99.828% <= 112.127 milliseconds (cumulative count 23552458)
99.831% <= 113.151 milliseconds (cumulative count 23553102)
99.834% <= 114.111 milliseconds (cumulative count 23553861)
99.838% <= 115.135 milliseconds (cumulative count 23554692)
99.842% <= 116.159 milliseconds (cumulative count 23555631)
99.846% <= 117.119 milliseconds (cumulative count 23556589)
99.850% <= 118.143 milliseconds (cumulative count 23557623)
99.853% <= 119.103 milliseconds (cumulative count 23558362)
99.857% <= 120.127 milliseconds (cumulative count 23559109)
99.858% <= 121.151 milliseconds (cumulative count 23559426)
99.859% <= 122.111 milliseconds (cumulative count 23559727)
99.861% <= 123.135 milliseconds (cumulative count 23560104)
99.862% <= 124.159 milliseconds (cumulative count 23560433)
99.864% <= 125.119 milliseconds (cumulative count 23560829)
99.865% <= 126.143 milliseconds (cumulative count 23561182)
99.866% <= 127.103 milliseconds (cumulative count 23561347)
99.867% <= 128.127 milliseconds (cumulative count 23561484)
99.868% <= 129.151 milliseconds (cumulative count 23561827)
99.870% <= 130.111 milliseconds (cumulative count 23562246)
99.871% <= 131.199 milliseconds (cumulative count 23562585)
99.873% <= 132.223 milliseconds (cumulative count 23563093)
99.875% <= 133.119 milliseconds (cumulative count 23563530)
99.878% <= 134.143 milliseconds (cumulative count 23564247)
99.881% <= 135.167 milliseconds (cumulative count 23564995)
99.884% <= 136.191 milliseconds (cumulative count 23565625)
99.887% <= 137.215 milliseconds (cumulative count 23566219)
99.889% <= 138.111 milliseconds (cumulative count 23566760)
99.891% <= 139.135 milliseconds (cumulative count 23567288)
99.893% <= 140.159 milliseconds (cumulative count 23567715)
99.895% <= 141.183 milliseconds (cumulative count 23568298)
99.898% <= 142.207 milliseconds (cumulative count 23568906)
99.900% <= 143.103 milliseconds (cumulative count 23569397)
99.902% <= 144.127 milliseconds (cumulative count 23569904)
99.903% <= 145.151 milliseconds (cumulative count 23570127)
99.905% <= 146.175 milliseconds (cumulative count 23570471)
99.906% <= 147.199 milliseconds (cumulative count 23570844)
99.908% <= 148.223 milliseconds (cumulative count 23571244)
99.909% <= 149.119 milliseconds (cumulative count 23571492)
99.910% <= 150.143 milliseconds (cumulative count 23571766)
99.911% <= 151.167 milliseconds (cumulative count 23572065)
99.913% <= 152.191 milliseconds (cumulative count 23572401)
99.915% <= 153.215 milliseconds (cumulative count 23572844)
99.916% <= 154.111 milliseconds (cumulative count 23573114)
99.918% <= 155.135 milliseconds (cumulative count 23573507)
99.920% <= 156.159 milliseconds (cumulative count 23574068)
99.922% <= 157.183 milliseconds (cumulative count 23574546)
99.923% <= 158.207 milliseconds (cumulative count 23574842)
99.925% <= 159.103 milliseconds (cumulative count 23575184)
99.926% <= 160.127 milliseconds (cumulative count 23575533)
99.928% <= 161.151 milliseconds (cumulative count 23575925)
99.930% <= 162.175 milliseconds (cumulative count 23576357)
99.931% <= 163.199 milliseconds (cumulative count 23576688)
99.932% <= 164.223 milliseconds (cumulative count 23576970)
99.933% <= 165.119 milliseconds (cumulative count 23577221)
99.935% <= 166.143 milliseconds (cumulative count 23577554)
99.937% <= 167.167 milliseconds (cumulative count 23578096)
99.938% <= 168.191 milliseconds (cumulative count 23578411)
99.940% <= 169.215 milliseconds (cumulative count 23578895)
99.942% <= 170.111 milliseconds (cumulative count 23579359)
99.944% <= 171.135 milliseconds (cumulative count 23579753)
99.945% <= 172.159 milliseconds (cumulative count 23580038)
99.947% <= 173.183 milliseconds (cumulative count 23580461)
99.948% <= 174.207 milliseconds (cumulative count 23580643)
99.949% <= 175.103 milliseconds (cumulative count 23581044)
99.950% <= 176.127 milliseconds (cumulative count 23581225)
99.951% <= 177.151 milliseconds (cumulative count 23581353)
99.952% <= 178.175 milliseconds (cumulative count 23581567)
99.952% <= 179.199 milliseconds (cumulative count 23581750)
99.953% <= 180.223 milliseconds (cumulative count 23581857)
99.953% <= 181.119 milliseconds (cumulative count 23581936)
99.954% <= 182.143 milliseconds (cumulative count 23582087)
99.954% <= 183.167 milliseconds (cumulative count 23582092)
99.954% <= 184.191 milliseconds (cumulative count 23582093)
99.954% <= 185.215 milliseconds (cumulative count 23582177)
99.955% <= 186.111 milliseconds (cumulative count 23582245)
99.955% <= 187.135 milliseconds (cumulative count 23582378)
99.956% <= 188.159 milliseconds (cumulative count 23582543)
99.956% <= 189.183 milliseconds (cumulative count 23582696)
99.957% <= 190.207 milliseconds (cumulative count 23582833)
99.958% <= 191.103 milliseconds (cumulative count 23582960)
99.958% <= 192.127 milliseconds (cumulative count 23583040)
99.958% <= 193.151 milliseconds (cumulative count 23583044)
99.958% <= 194.175 milliseconds (cumulative count 23583061)
99.959% <= 195.199 milliseconds (cumulative count 23583209)
99.959% <= 196.223 milliseconds (cumulative count 23583350)
99.960% <= 197.119 milliseconds (cumulative count 23583475)
99.960% <= 198.143 milliseconds (cumulative count 23583607)
99.961% <= 199.167 milliseconds (cumulative count 23583769)
99.962% <= 200.191 milliseconds (cumulative count 23584067)
99.963% <= 201.215 milliseconds (cumulative count 23584158)
99.963% <= 202.111 milliseconds (cumulative count 23584294)
99.965% <= 203.135 milliseconds (cumulative count 23584620)
99.966% <= 204.159 milliseconds (cumulative count 23584861)
99.966% <= 205.183 milliseconds (cumulative count 23584960)
99.967% <= 206.207 milliseconds (cumulative count 23585141)
99.967% <= 207.103 milliseconds (cumulative count 23585174)
99.967% <= 208.127 milliseconds (cumulative count 23585225)
99.967% <= 209.151 milliseconds (cumulative count 23585252)
99.967% <= 212.223 milliseconds (cumulative count 23585272)
99.967% <= 213.119 milliseconds (cumulative count 23585292)
99.968% <= 214.143 milliseconds (cumulative count 23585321)
99.968% <= 215.167 milliseconds (cumulative count 23585322)
99.968% <= 218.111 milliseconds (cumulative count 23585327)
99.968% <= 219.135 milliseconds (cumulative count 23585348)
99.968% <= 220.159 milliseconds (cumulative count 23585398)
99.968% <= 221.183 milliseconds (cumulative count 23585422)
99.968% <= 223.103 milliseconds (cumulative count 23585459)
99.968% <= 224.127 milliseconds (cumulative count 23585472)
99.968% <= 231.167 milliseconds (cumulative count 23585497)
99.968% <= 232.191 milliseconds (cumulative count 23585516)
99.968% <= 233.215 milliseconds (cumulative count 23585522)
99.969% <= 235.135 milliseconds (cumulative count 23585570)
99.969% <= 236.159 milliseconds (cumulative count 23585574)
99.969% <= 239.103 milliseconds (cumulative count 23585586)
99.969% <= 240.127 milliseconds (cumulative count 23585624)
99.969% <= 247.167 milliseconds (cumulative count 23585653)
99.969% <= 248.191 milliseconds (cumulative count 23585654)
99.969% <= 259.199 milliseconds (cumulative count 23585721)
99.970% <= 260.223 milliseconds (cumulative count 23585824)
99.970% <= 261.119 milliseconds (cumulative count 23585897)
99.970% <= 262.143 milliseconds (cumulative count 23585936)
99.970% <= 263.167 milliseconds (cumulative count 23585954)
99.970% <= 268.287 milliseconds (cumulative count 23585989)
99.971% <= 269.311 milliseconds (cumulative count 23586004)
99.971% <= 288.255 milliseconds (cumulative count 23586017)
99.971% <= 289.279 milliseconds (cumulative count 23586053)
99.971% <= 290.303 milliseconds (cumulative count 23586061)
99.971% <= 291.327 milliseconds (cumulative count 23586097)
99.971% <= 292.351 milliseconds (cumulative count 23586104)
99.971% <= 293.119 milliseconds (cumulative count 23586109)
99.971% <= 294.143 milliseconds (cumulative count 23586138)
99.971% <= 295.167 milliseconds (cumulative count 23586154)
99.971% <= 296.191 milliseconds (cumulative count 23586165)
99.971% <= 297.215 milliseconds (cumulative count 23586232)
99.972% <= 298.239 milliseconds (cumulative count 23586270)
99.972% <= 299.263 milliseconds (cumulative count 23586350)
99.972% <= 300.287 milliseconds (cumulative count 23586380)
99.973% <= 301.311 milliseconds (cumulative count 23586472)
99.973% <= 302.335 milliseconds (cumulative count 23586603)
99.973% <= 303.103 milliseconds (cumulative count 23586652)
99.973% <= 304.127 milliseconds (cumulative count 23586680)
99.974% <= 305.151 milliseconds (cumulative count 23586820)
99.974% <= 306.175 milliseconds (cumulative count 23586921)
99.974% <= 308.223 milliseconds (cumulative count 23586939)
99.975% <= 309.247 milliseconds (cumulative count 23586971)
99.975% <= 312.319 milliseconds (cumulative count 23587007)
99.975% <= 313.343 milliseconds (cumulative count 23587040)
99.975% <= 314.111 milliseconds (cumulative count 23587054)
99.975% <= 315.135 milliseconds (cumulative count 23587089)
99.975% <= 316.159 milliseconds (cumulative count 23587151)
99.975% <= 317.183 milliseconds (cumulative count 23587171)
99.975% <= 318.207 milliseconds (cumulative count 23587177)
99.976% <= 319.231 milliseconds (cumulative count 23587221)
99.976% <= 322.303 milliseconds (cumulative count 23587249)
99.976% <= 323.327 milliseconds (cumulative count 23587271)
99.976% <= 327.167 milliseconds (cumulative count 23587338)
99.976% <= 328.191 milliseconds (cumulative count 23587401)
99.977% <= 329.215 milliseconds (cumulative count 23587450)
99.977% <= 330.239 milliseconds (cumulative count 23587471)
99.977% <= 331.263 milliseconds (cumulative count 23587483)
99.977% <= 332.287 milliseconds (cumulative count 23587535)
99.977% <= 333.311 milliseconds (cumulative count 23587561)
99.977% <= 334.335 milliseconds (cumulative count 23587571)
99.977% <= 335.103 milliseconds (cumulative count 23587589)
99.977% <= 336.127 milliseconds (cumulative count 23587626)
99.977% <= 337.151 milliseconds (cumulative count 23587642)
99.978% <= 338.175 milliseconds (cumulative count 23587662)
99.978% <= 339.199 milliseconds (cumulative count 23587679)
99.978% <= 340.223 milliseconds (cumulative count 23587692)
99.978% <= 344.319 milliseconds (cumulative count 23587705)
99.978% <= 345.343 milliseconds (cumulative count 23587755)
99.978% <= 346.111 milliseconds (cumulative count 23587789)
99.978% <= 347.135 milliseconds (cumulative count 23587824)
99.978% <= 348.159 milliseconds (cumulative count 23587869)
99.979% <= 349.183 milliseconds (cumulative count 23587892)
99.979% <= 352.255 milliseconds (cumulative count 23587940)
99.979% <= 353.279 milliseconds (cumulative count 23587984)
99.979% <= 354.303 milliseconds (cumulative count 23588031)
99.979% <= 355.327 milliseconds (cumulative count 23588110)
99.980% <= 356.351 milliseconds (cumulative count 23588142)
99.980% <= 357.119 milliseconds (cumulative count 23588164)
99.980% <= 358.143 milliseconds (cumulative count 23588179)
99.980% <= 359.167 milliseconds (cumulative count 23588195)
99.980% <= 360.191 milliseconds (cumulative count 23588230)
99.980% <= 361.215 milliseconds (cumulative count 23588242)
99.980% <= 363.263 milliseconds (cumulative count 23588317)
99.980% <= 364.287 milliseconds (cumulative count 23588342)
99.981% <= 366.335 milliseconds (cumulative count 23588380)
99.981% <= 367.103 milliseconds (cumulative count 23588428)
99.981% <= 368.127 milliseconds (cumulative count 23588442)
99.981% <= 372.223 milliseconds (cumulative count 23588461)
99.981% <= 373.247 milliseconds (cumulative count 23588517)
99.981% <= 374.271 milliseconds (cumulative count 23588569)
99.981% <= 375.295 milliseconds (cumulative count 23588592)
99.982% <= 379.135 milliseconds (cumulative count 23588646)
99.982% <= 380.159 milliseconds (cumulative count 23588692)
99.982% <= 385.279 milliseconds (cumulative count 23588722)
99.982% <= 386.303 milliseconds (cumulative count 23588769)
99.982% <= 387.327 milliseconds (cumulative count 23588787)
99.982% <= 388.351 milliseconds (cumulative count 23588792)
99.982% <= 402.175 milliseconds (cumulative count 23588793)
99.982% <= 403.199 milliseconds (cumulative count 23588829)
99.983% <= 404.223 milliseconds (cumulative count 23588842)
99.983% <= 410.111 milliseconds (cumulative count 23588865)
99.983% <= 411.135 milliseconds (cumulative count 23588892)
99.983% <= 415.231 milliseconds (cumulative count 23588929)
99.983% <= 416.255 milliseconds (cumulative count 23588991)
99.983% <= 417.279 milliseconds (cumulative count 23588992)
99.983% <= 419.327 milliseconds (cumulative count 23589031)
99.983% <= 420.351 milliseconds (cumulative count 23589042)
99.984% <= 421.119 milliseconds (cumulative count 23589072)
99.984% <= 422.143 milliseconds (cumulative count 23589092)
99.984% <= 426.239 milliseconds (cumulative count 23589113)
99.984% <= 427.263 milliseconds (cumulative count 23589140)
99.984% <= 428.287 milliseconds (cumulative count 23589232)
99.984% <= 429.311 milliseconds (cumulative count 23589290)
99.985% <= 431.103 milliseconds (cumulative count 23589355)
99.985% <= 432.127 milliseconds (cumulative count 23589390)
99.985% <= 433.151 milliseconds (cumulative count 23589436)
99.985% <= 434.175 milliseconds (cumulative count 23589485)
99.985% <= 435.199 milliseconds (cumulative count 23589507)
99.986% <= 436.223 milliseconds (cumulative count 23589567)
99.986% <= 437.247 milliseconds (cumulative count 23589628)
99.986% <= 438.271 milliseconds (cumulative count 23589670)
99.986% <= 439.295 milliseconds (cumulative count 23589690)
99.986% <= 442.111 milliseconds (cumulative count 23589760)
99.987% <= 443.135 milliseconds (cumulative count 23589796)
99.987% <= 444.159 milliseconds (cumulative count 23589810)
99.987% <= 493.311 milliseconds (cumulative count 23589838)
99.987% <= 494.335 milliseconds (cumulative count 23589860)
99.987% <= 499.199 milliseconds (cumulative count 23589870)
99.987% <= 500.223 milliseconds (cumulative count 23589883)
99.987% <= 501.247 milliseconds (cumulative count 23589910)
99.987% <= 509.183 milliseconds (cumulative count 23589923)
99.987% <= 510.207 milliseconds (cumulative count 23589957)
99.987% <= 511.231 milliseconds (cumulative count 23589960)
99.987% <= 527.359 milliseconds (cumulative count 23589963)
99.987% <= 528.383 milliseconds (cumulative count 23590010)
99.988% <= 530.431 milliseconds (cumulative count 23590011)
99.988% <= 531.455 milliseconds (cumulative count 23590040)
99.988% <= 532.479 milliseconds (cumulative count 23590054)
99.988% <= 533.503 milliseconds (cumulative count 23590060)
99.988% <= 674.303 milliseconds (cumulative count 23590087)
99.988% <= 675.327 milliseconds (cumulative count 23590110)
99.988% <= 722.431 milliseconds (cumulative count 23590140)
99.988% <= 723.455 milliseconds (cumulative count 23590160)
99.988% <= 737.279 milliseconds (cumulative count 23590177)
99.988% <= 738.303 milliseconds (cumulative count 23590193)
99.988% <= 739.327 milliseconds (cumulative count 23590210)
99.988% <= 977.407 milliseconds (cumulative count 23590238)
99.989% <= 978.431 milliseconds (cumulative count 23590260)
99.989% <= 1246.207 milliseconds (cumulative count 23590279)
99.989% <= 1247.231 milliseconds (cumulative count 23590310)
99.989% <= 1267.711 milliseconds (cumulative count 23590327)
99.989% <= 1268.735 milliseconds (cumulative count 23590358)
99.989% <= 1269.759 milliseconds (cumulative count 23590360)
99.989% <= 1815.551 milliseconds (cumulative count 23590388)
99.989% <= 1816.575 milliseconds (cumulative count 23590410)
99.989% <= 1863.679 milliseconds (cumulative count 23590439)
99.989% <= 1864.703 milliseconds (cumulative count 23590460)
99.990% <= 1909.759 milliseconds (cumulative count 23590488)
99.990% <= 1910.783 milliseconds (cumulative count 23590510)
99.990% <= 1987.583 milliseconds (cumulative count 23590542)
99.990% <= 1988.607 milliseconds (cumulative count 23590560)
99.990% <= 2057.215 milliseconds (cumulative count 23590590)
99.990% <= 2058.239 milliseconds (cumulative count 23590600)
99.990% <= 2059.263 milliseconds (cumulative count 23590610)
99.990% <= 2500.607 milliseconds (cumulative count 23590660)
99.990% <= 2572.287 milliseconds (cumulative count 23590695)
99.990% <= 2574.335 milliseconds (cumulative count 23590710)
99.991% <= 2615.295 milliseconds (cumulative count 23590725)
99.991% <= 2617.343 milliseconds (cumulative count 23590760)
99.991% <= 2756.607 milliseconds (cumulative count 23590805)
99.991% <= 2758.655 milliseconds (cumulative count 23590810)
99.991% <= 2783.231 milliseconds (cumulative count 23590860)
99.991% <= 3086.335 milliseconds (cumulative count 23590943)
99.992% <= 3088.383 milliseconds (cumulative count 23590960)
99.992% <= 3155.967 milliseconds (cumulative count 23590982)
99.992% <= 3158.015 milliseconds (cumulative count 23591010)
99.992% <= 3332.095 milliseconds (cumulative count 23591052)
99.992% <= 3334.143 milliseconds (cumulative count 23591060)
99.992% <= 3438.591 milliseconds (cumulative count 23591110)
99.992% <= 3553.279 milliseconds (cumulative count 23591116)
99.992% <= 3555.327 milliseconds (cumulative count 23591142)
99.992% <= 3557.375 milliseconds (cumulative count 23591160)
99.993% <= 3639.295 milliseconds (cumulative count 23591210)
99.993% <= 3680.255 milliseconds (cumulative count 23591260)
99.993% <= 3934.207 milliseconds (cumulative count 23591285)
99.993% <= 3936.255 milliseconds (cumulative count 23591310)
99.993% <= 4028.415 milliseconds (cumulative count 23591339)
99.993% <= 4030.463 milliseconds (cumulative count 23591360)
99.993% <= 4210.687 milliseconds (cumulative count 23591410)
99.994% <= 4304.895 milliseconds (cumulative count 23591460)
99.994% <= 4341.759 milliseconds (cumulative count 23591489)
99.994% <= 4345.855 milliseconds (cumulative count 23591510)
99.994% <= 4411.391 milliseconds (cumulative count 23591511)
99.994% <= 4415.487 milliseconds (cumulative count 23591560)
99.994% <= 4427.775 milliseconds (cumulative count 23591561)
99.994% <= 4616.191 milliseconds (cumulative count 23591590)
99.994% <= 4620.287 milliseconds (cumulative count 23591610)
99.994% <= 4747.263 milliseconds (cumulative count 23591660)
99.995% <= 4947.967 milliseconds (cumulative count 23591710)
99.995% <= 5111.807 milliseconds (cumulative count 23591738)
99.995% <= 5115.903 milliseconds (cumulative count 23591760)
99.995% <= 5185.535 milliseconds (cumulative count 23591810)
99.995% <= 5214.207 milliseconds (cumulative count 23591860)
99.995% <= 5459.967 milliseconds (cumulative count 23591892)
99.996% <= 5464.063 milliseconds (cumulative count 23591910)
99.996% <= 5718.015 milliseconds (cumulative count 23591960)
99.996% <= 5750.783 milliseconds (cumulative count 23592010)
99.996% <= 5976.063 milliseconds (cumulative count 23592037)
99.996% <= 5980.159 milliseconds (cumulative count 23592060)
99.996% <= 5984.255 milliseconds (cumulative count 23592079)
99.996% <= 5988.351 milliseconds (cumulative count 23592110)
99.997% <= 6025.215 milliseconds (cumulative count 23592158)
99.997% <= 6029.311 milliseconds (cumulative count 23592160)
99.997% <= 6213.631 milliseconds (cumulative count 23592210)
99.997% <= 6389.759 milliseconds (cumulative count 23592260)
99.997% <= 6475.775 milliseconds (cumulative count 23592310)
99.997% <= 6520.831 milliseconds (cumulative count 23592360)
99.998% <= 6549.503 milliseconds (cumulative count 23592410)
99.998% <= 6729.727 milliseconds (cumulative count 23592460)
99.998% <= 6901.759 milliseconds (cumulative count 23592487)
99.998% <= 7098.367 milliseconds (cumulative count 23592510)
99.998% <= 7217.151 milliseconds (cumulative count 23592538)
99.998% <= 7221.247 milliseconds (cumulative count 23592560)
99.999% <= 7442.431 milliseconds (cumulative count 23592609)
99.999% <= 7446.527 milliseconds (cumulative count 23592610)
99.999% <= 7647.231 milliseconds (cumulative count 23592630)
99.999% <= 7786.495 milliseconds (cumulative count 23592680)
99.999% <= 7843.839 milliseconds (cumulative count 23592730)
99.999% <= 7856.127 milliseconds (cumulative count 23592734)
99.999% <= 7860.223 milliseconds (cumulative count 23592760)
99.999% <= 8585.215 milliseconds (cumulative count 23592810)
100.000% <= 8904.703 milliseconds (cumulative count 23592860)
100.000% <= 9486.335 milliseconds (cumulative count 23592910)
100.000% <= 9732.095 milliseconds (cumulative count 23592960)
100.000% <= 9732.095 milliseconds (cumulative count 23592960)
100.000% <= 9732.095 milliseconds (cumulative count 23592960)
[...]

Summary:
  throughput summary: 23457.61 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        1.967     0.144     0.807     1.543     9.127  9732.095